/**
 * Created with IntelliJ IDEA.
 * Author:rzx
 * Date:2017/6/8
 */
package com.rzx.train;
/**
 *ML：机器学习
 * 基本流程：
 *      数据准备：
 *      数据清洗/处理：缺失值处理，无用值处理，数据格式化【向量化，归一化，正则化，】，降维【PCA，权重截取】
 *      模型选择：分类？回归？
 *      训练模型：
 *      模型预测：
 *
 * 通用算法：
 *      回归：
 *      分类：
 *      聚类：
 * 基本工具：
 * 基本平台：Kaggle ,sparkMl
 * DL：深度学习
 *
 *语言：=========================================================================================================
 *      JAVA:
 *          集合框架：
 *          多线程：
 *              线程
 *              线程池:
 *              concurrent:
 *              Lock:
 *              Atomic:
 *              容器：
 *                  各种阻塞队列，Map.
 *          IO/NIO:
 *
 *      Python:
 *           python数据科学库
 *           sklearn
 *      Scala:
 *          SparkML
 * 机器学习：
 *     ML：
 *      回归：
 *      分类：
 *      聚类：
 *     DL:
 *      ...
 *  大数据：
 *      Hadoop/Mapreduce
 *      Spark
 *=========================================================================================================
 * 计划：
 *     1:::: 2017-6-8    =======>   2017-6-10         JAVA集合框架+序列化+动态代理
 *     2:::: 2017-6-11    =======>   2017-6-13        Lock锁：应用，浅看
 *     2:::: 2017-6-14    =======>   2017-6-16        容器：query，map, List：理解场景
 *     2:::: 2017-6-17    =======>   2017-6-19        IO：
 *     2:::: 2017-6-20    =======>   2017-6-22        NIO：
 *     2:::: 2017-6-20    =======>   2017-6-22        JVM:类加载+内存分区+gc算法
 *     2:::: 2017-6-23    =======>   2017-6-25        JVM:gc收集器
 *
 *
 */
